In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("raw_data.csv")

In [5]:
df.head()

  customer_id  age  gender  annual_income_k$  spending_score
0       C0001   58  Female                71            38.5
1       C0002   25  Female               139            86.0
2       C0003   19    Male                71            37.6
3       C0004   65    Male                84            63.0
4       C0005   35    Male               126            74.3

In [6]:
df.tail()

    customer_id  age  gender  annual_income_k$  spending_score
295       C0296   24    Male                28            16.9
296       C0297   60  Female                67            22.0
297       C0298   45  Female                83            54.0
298       C0299   40  Female                48            19.8
299       C0300   45  Female                88            42.7

In [7]:
df.shape

(300, 5)

In [8]:
df.columns

Index(['customer_id', 'age', 'gender', 'annual_income_k$', 'spending_score'], dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       300 non-null    object
 1   age               300 non-null    int64
 2   gender            300 non-null    object
 3   annual_income_k$  300 non-null    int64
 4   spending_score    300 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 11.8+ KB

In [10]:
df.isnull().sum()                   #missing valuee

customer_id         0
age                 0
gender              0
annual_income_k$    0
spending_score      0
dtype: int64

In [11]:
df.duplicated().sum()             # duplicate rows

0

In [14]:
df['spending_category'] = pd.cut(                    #spending category (add new coloumn)
    df['spending_score'],
    bins = 3,
    labels = ['Low', 'Medium', 'High']
)

In [15]:
df

,customer_id,age,gender,annual_income_k$,spending_score,spending_category
0,C0001,58,Female,71,38.5,Medium
1,C0002,25,Female,139,86.0,High
2,C0003,19,Male,71,37.6,Medium
3,C0004,65,Male,84,63.0,Medium
4,C0005,35,Male,126,74.3,High
...,...,...,...,...,...,...
295,C0296,24,Male,28,16.9,Low
296,C0297,60,Female,67,22.0,Low
297,C0298,45,Female,83,54.0,Medium
298,C0299,40,Female,48,19.8,Low
299,C0300,45,Female,88,42.7,Medium

In [18]:
'''Thise feature capture how aggressively a customer spends
   realtive to thier income and age'''

df['Spending_Intensity'] = (
    df['spending_score'] +
    df['annual_income_k$'] / df[ 'age']
)

In [20]:
df.head()

,customer_id,age,gender,annual_income_k$,spending_score,spending_category,Spending_Intensity
0,C0001,58,Female,71,38.5,Medium,39.724138
1,C0002,25,Female,139,86.0,High,91.560000
2,C0003,19,Male,71,37.6,Medium,41.336842
3,C0004,65,Male,84,63.0,Medium,64.292308
4,C0005,35,Male,126,74.3,High,77.900000

In [21]:
df.columns

Index(['customer_id', 'age', 'gender', 'annual_income_k$', 'spending_score',
       'spending_category', 'Spending_Intensity'],
      dtype='object')

In [23]:
df.to_csv("cleaned_data.csv", index = False)